{
  "backend/main.mo": "Motoko actor defining user profiles, roles, location types, gate pass and inventory types, with authorization checks and profile CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains short predefined summaries for selected frontend files.",
  "frontend/docs/api-design.md": "Describes the backend API endpoints, authorization rules, and data contracts for the system.",
  "frontend/docs/database-schema.md": "Outlines intended persistent data structures for the backend.",
  "frontend/docs/project-structure.md": "High-level recommended folder and module layout for frontend and backend.",
  "frontend/docs/ui-wireframes.md": "Text-based UI wireframes and navigation matrix for all key role-based screens.",
  "frontend/docs/user-stories.md": "User stories and acceptance criteria for major workflows like gate passes, receiving, and security confirmation.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables and light/dark mode tokens.",
  "frontend/index.html": "HTML entry point loading the frontend app and mounting the root element.",
  "frontend/src/api/actorClient.ts": "Wraps useActor to expose typed actor methods for user profiles and placeholder backend operations.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile loading, and rendering login or profile setup states.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a dialog for collecting and saving a user's name during initial profile setup.",
  "frontend/src/components/StatusBadge.tsx": "Displays a status badge with labels and colors based on gatepass, stocktake, or exception status maps.",
  "frontend/src/features/README.md": "Describes the structure and purpose of feature modules such as gate pass, receiving, security, inventory, stocktake, reports, and audit.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities, handling login/logout, and managing login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for user profiles and placeholder backend actions with invalidation logic.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom light/dark theme variables for a logistics-themed UI.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/shared/constants/hu.ts": "Defines HU type constants, labels, descriptions, and helpers for inventory and security logic.",
  "frontend/src/shared/constants/roles.ts": "Defines role constants, labels, descriptions, permissions, and helper checks for role-based access.",
  "frontend/src/shared/constants/status.ts": "Provides status enums, labels, and color mappings for gate passes, stock takes, exceptions, inventory, and locations.",
  "frontend/src/shared/queryKeys.ts": "Central list of React Query keys and key factories for caching API data.",
  "frontend/src/shared/types/domain.ts": "TypeScript interfaces modeling user profiles, locations, gate passes, inventory, stock takes, exceptions, reports, and audit data.",
  "frontend/src/utils/exporters.ts": "Utility functions to format data and export various reports to CSV, including date formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, typography, container settings, fonts, animations, and theme tokens.",
  "project_state.json": "Defines overall HU Management System state including version, high-level functional scope, architectural notes, and existing features. Captures inventory rules, auditing requirements, reporting needs, and project capabilities for planning."
}